<a href="https://colab.research.google.com/github/gzoppelt/ztdl-5-day-bootcamp/blob/master/day_1/Lab_02_DA%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# File Access

In [0]:
!git clone https://github.com/gzoppelt/ztdl-5-day-bootcamp.git

In [7]:
!ls

sample_data  ztdl-5-day-bootcamp

# Pandas

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

You can find it here: http://pandas.pydata.org/

And the documentation can be found here: http://pandas.pydata.org/pandas-docs/stable/

In this notebook we review some of its functionality.

In [0]:
import pandas as pd

In [0]:
df = pd.read_csv("ztdl-5-day-bootcamp/data/titanic-train.csv")

## Quick exploration

Commands to quickly inspect the dataset

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [0]:
df.info()

In [13]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Indexing

Retrieving elements by row, by column or both. Try to understand each of the following statements

In [0]:
df['Ticket']

In [0]:
df[['Fare', 'Ticket']]

In [0]:
df.iloc[3]

In [0]:
df.iloc[3, 4]

In [0]:
df.loc[0:4,'Ticket']

In [0]:
df.loc[0:4, ['Fare', 'Ticket']]

## Selections

Retrieving part of the dataframe based on a condition. Try to understand each of the following statements.

In [0]:
df[df.Age > 70]

In [24]:
df[(df['Age'] == 11) & (df['SibSp'] == 5)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S

In [0]:
df[(df.Age == 11) | (df.SibSp == 5)]

In [0]:
df.query('(Age == 11) & (SibSp == 5)')

In [0]:
df.sort_values('Age', ascending = False).head()

## Distinct elements

In [0]:
df['Embarked'].unique()

## Group by

Pandas supports many SQL-like operations like group by, order by and join. In pandas they are called:
- groupby
- sort_values
- merge

Try to make sense of each of the following expressions:

In [16]:
# Find average age of passengers that survived vs. died
df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [0]:
df.sort_values('Age', ascending = False).head()

In [22]:
df1 = df[['PassengerId', 'Survived']]
df2 = df[['PassengerId', 'Age']]

pd.merge(df1, df2, on='PassengerId').head()

   PassengerId  Survived   Age
0            1         0  22.0
1            2         1  38.0
2            3         1  26.0
3            4         1  35.0
4            5         0  35.0

## Pivot Tables

Pandas also supports Excel-like functionality like pivot tables.

In [20]:
df.pivot_table(index='Pclass', columns='Survived', values='PassengerId', aggfunc='count')

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [21]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

## Exercises:

- select passengers that survived

In [0]:
df[df['Survived'] == 1]['Name']

- select passengers that embarked in port S

In [0]:
df[df['Embarked'] == 'S']

- select male passengers

In [0]:
df[df['Sex'] == 'male']

- select passengers who paid less than 40.000 and were in third class

In [0]:
df[(df['Fare'] < 6) & (df['Pclass'] == 3)]

- locate the name of passegner Id 674

In [39]:
df[df['PassengerId'] == 674]['Name']

673    Wilhelms, Mr. Charles
Name: Name, dtype: object

- calculate the average age of passengers using the function mean()

In [40]:
df['Age'].mean()

29.69911764705882

- count the number of survived and the number of dead passengers

In [41]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

- count the number of males and females

In [43]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

- count the number of survived and dead per each gender

In [44]:
df.pivot_table(index='Sex', columns='Survived', values='PassengerId', aggfunc='count')

Survived    0    1
Sex
female     81  233
male      468  109


- calculate average price paid by survived and dead people in each class

In [46]:
df.groupby('Survived')['Fare'].mean()

Survived
0    22.117887
1    48.395408
Name: Fare, dtype: float64